<details><summary style="display:list-item; font-size:16px; color:blue;">Jupyter Help</summary>
    
Having trouble testing your work? Double-check that you have followed the steps below to write, run, save, and test your code!
    
[Click here for a walkthrough GIF of the steps below](https://static-assets.codecademy.com/Courses/ds-python/jupyter-help.gif)

Run all initial cells to import libraries and datasets. Then follow these steps for each question:
    
1. Add your solution to the cell with `## YOUR SOLUTION HERE ## `.
2. Run the cell by selecting the `Run` button or the `Shift`+`Enter` keys.
3. Save your work by selecting the `Save` button, the `command`+`s` keys (Mac), or `control`+`s` keys (Windows).
4. Select the `Test Work` button at the bottom left to test your work.

![Screenshot of the buttons at the top of a Jupyter Notebook. The Run and Save buttons are highlighted](https://static-assets.codecademy.com/Paths/ds-python/jupyter-buttons.png)

#### Setup

Start by running the cell below to import `pandas` and import the exercise datasets.

In [1]:
import pandas as pd
games = pd.read_csv('games.csv')
scores = pd.read_csv('scores.csv')
locations = pd.read_csv('locations.csv')

#### Narrative Examples

The cell below generates the example from the exercise narrative. Run the code to see how pandas performs the merge. Feel free to experiment with the different options!

In [2]:
X = pd.DataFrame({'Category':['A','B'], 'Value':[1,2]})
Y = pd.DataFrame({'Category':['B','C'], 'Value':[3,4]})

pd.merge(left = X, right = Y, left_on = 'Category', right_on='Category', how='outer')

  Category  Value_x  Value_y
0        A      1.0      NaN
1        B      2.0      3.0
2        C      NaN      4.0

#### 1. Outer Merge `games` and `scores`

Perform an outer merge with `games` on the left and `scores` on the right. Use the columns `scores_id` and `id`. Assign the result to `merged_df`.

Make sure to run the solution cell and save the notebook before selecting `Test Work`.

In [3]:
## YOUR SOLUTION HERE ##
merged_df = pd.merge(left = games,
         right = scores,
         left_on = 'scores_id',
         right_on = 'id',
         how = 'outer')

# show output
merged_df.head()

,date,home_team,away_team,location_id,scores_id,id,home_score,away_score
0,1872-11-30,Scotland,England,0.0,0.0,0.0,0.0,0.0
1,1914-02-28,Scotland,Wales,0.0,0.0,0.0,0.0,0.0
2,1946-11-27,Scotland,Northern Ireland,0.0,0.0,0.0,0.0,0.0
3,1965-05-08,Scotland,Spain,0.0,0.0,0.0,0.0,0.0
4,1970-04-22,Scotland,Wales,0.0,0.0,0.0,0.0,0.0

#### 2. Post-Merge Analysis

In the cell below, we've filtered `merged_df` using the method `.isna().any(axis=1)`, which detects all rows containing `NaN`s. Run the cell -- it should look like a combination of the last two exercises!

In [4]:
## YOUR SOLUTION HERE ##
merged_df[merged_df.isna().any(axis=1)]

,date,home_team,away_team,location_id,scores_id,id,home_score,away_score
44336,1969-08-18,Fiji,New Caledonia,492.0,122.0,NaN,NaN,NaN
44337,1975-08-04,Guam,Fiji,572.0,122.0,NaN,NaN,NaN
44338,2019-07-18,Samoa,Vanuatu,1301.0,122.0,NaN,NaN,NaN
44339,2021-03-29,Cayman Islands,Canada,1995.0,122.0,NaN,NaN,NaN
44352,NaN,NaN,NaN,NaN,NaN,127.0,22.0,0.0